[
  {
    "_id": {
      "$oid": "649ac0a589f9cc13fb27c8c5"
    },
    "title": "Disruptive Thinking: A Daring Strategy to Change How We Live, Lead, and Love",
    "authors": ["T. D. Jakes", "Nick Chiles"],
    "publishedDate": "June 1, 2021",
    "description": "In this book for leaders, thinkers, doers, and creators, Bishop T.D. Jakes illuminates the pathway to encouraging and unleashing disruptive thinking and provides the wisdom and practical skills we need to evolve our most original and potentially transformational ideas from vision to reality. Through his insight into how our minds and emotions work and through his experiences as a pastor, entrepreneur, and creator, Bishop Jakes leads us into a new way of relating to and transforming the world around us for good. Disruptive Thinking will show you the mindset and the tools you need to create groundbreaking and meaningful change in your own life and in the world around you.",
    "pageCount": 272,
    "categories": ["Self-Help"],
    "subCategories": ["Motivationl"],
    "imageLinks": {
      "thumbnail": "//ws-na.amazon-adsystem.com/widgets/q?_encoding=UTF8&ASIN=1546004009&Format=_SL250_&ID=AsinImage&MarketPlace=US&ServiceVersion=20070822&WS=1&tag=techweb04-20&language=en_US"
    },
    "language": "en",
    "saleInfo": {
      "country": "USA",
      "price": 16.93,
      "discountPrice": 15.93,
      "availableCopy": 20,
      "totalSales": 10,
      "upto75off": true
    },
    "reviews": []
  },
  {
    "_id": {
      "$oid": "649ac0a589f9cc13fb27c8c6"
    },
    "title": "The Mountain Is You: Transforming Self-Sabotage Into Self-Mastery",
    "authors": ["Brianna Wiest"],
    "publishedDate": "January 01, 2022",
    "description": "This is a book about self-sabotage. Why we do it, when we do it, and how to stop doing it—for good. Coexisting but conflicting needs create self-sabotaging behaviors. This is why we resist efforts to change, often until they feel completely futile. But by extracting crucial insight from our most damaging habits, building emotional intelligence by better understanding our brains and bodies, releasing past experiences at a cellular level, and learning to act as our highest potential future selves, we can step out of our own way and into our potential. For centuries, the mountain has been used as a metaphor for the big challenges we face, especially ones that seem impossible to overcome. To scale our mountains, we actually have to do the deep internal work of excavating trauma, building resilience, and adjusting how we show up for the climb. In the end, it is not the mountain we master, but ourselves.",
    "pageCount": 248,
    "categories": ["Self-Help"],
    "subCategories": ["Motivationl"],
    "imageLinks": {
      "thumbnail": "//ws-na.amazon-adsystem.com/widgets/q?_encoding=UTF8&ASIN=1949759229&Format=_SL250_&ID=AsinImage&MarketPlace=US&ServiceVersion=20070822&WS=1&tag=techweb04-20&language=en_US"
    },
    "language": "en",
    "saleInfo": {
      "country": "USA",
      "price": 17.99,
      "discountPrice": 14.99,
      "availableCopy": 10,
      "totalSales": 12
    },
    "reviews": []
  },
  {
    "_id": {
      "$oid": "649ac0a589f9cc13fb27c8c7"
    },
    "title": "Read Me When You Need Me.",
    "authors": ["NSB Books"],
    "publishedDate": "November 21, 2022",
    "description": "This book sets us in a time where we can possess a written form of love expressed by another person, like an old classy letter, to someone close to you or someone who's been so close to you but distance may have taken it's place. This book serves not just as a sentimental gift, but a keepsake, a forever reminder of your gratitude for that one special person. ",
    "pageCount": 130,
    "categories": ["Self-Help"],
    "subCategories": ["Motivationl"],
    "imageLinks": {
      "thumbnail": "//ws-na.amazon-adsystem.com/widgets/q?_encoding=UTF8&ASIN=B0BMSZSG5Z&Format=_SL250_&ID=AsinImage&MarketPlace=US&ServiceVersion=20070822&WS=1&tag=techweb04-20&language=en_US"
    },
    "language": "en",
    "saleInfo": {
      "country": "USA",
      "price": 9.99,
      "discountPrice": 2.99,
      "availableCopy": 40,
      "totalSales": 30
    },
    "reviews": []
  },
  {
    "_id": {
      "$oid": "649ac0a589f9cc13fb27c8c8"
    },
    "title": "As a Man Thinketh: A book that will help you to help yourself",
    "authors": ["James Allen"],
    "publishedDate": "August 24, 2021",
    "description": "As a Man Thinketh is a self-help book by James Allen, published in 1903. It was described by Allen as '... [dealing] with the power of thought, and particularly with the use and application of thought to happy and beautiful issues. I have tried to make the book simple, so that all can easily grasp and follow its teaching, and put into practice the methods which it advises. It shows how, in his own thought-world, each man holds the key to every condition, good or bad, that enters into his life, and that, by working patiently and intelligently upon his thoughts, he may remake his life, and transform his circumstances. The price of the book is only one shilling, and it can be carried in the pocket.' It was also described by Allen as 'A book that will help you to help yourself', 'A pocket companion for thoughtful people', and 'A book on the power and right application of thought.",
    "pageCount": 77,
    "categories": ["Self-Help"],
    "subCategories": ["Personal Transformation"],
    "imageLinks": {
      "thumbnail": "//ws-na.amazon-adsystem.com/widgets/q?_encoding=UTF8&ASIN=B09DJ8TT61&Format=_SL250_&ID=AsinImage&MarketPlace=US&ServiceVersion=20070822&WS=1&tag=techweb04-20&language=en_US"
    },
    "language": "en",
    "saleInfo": {
      "country": "USA",
      "price": 11.99,
      "discountPrice": 7.99,
      "availableCopy": 30,
      "totalSales": 1000,
      "upto75off": true
    },
    "reviews": []
  },
  {
    "_id": {
      "$oid": "649ac0a589f9cc13fb27c8c9"
    },
    "title": "Can't Hurt Me: Master Your Mind and Defy the Odds - Clean Edition",
    "authors": ["David Goggins"],
    "publishedDate": "June 1, 2020",
    "description": "For David Goggins, childhood was a nightmare - poverty, prejudice, and physical abuse colored his days and haunted his nights. But through self-discipline, mental toughness, and hard work, Goggins transformed himself from a depressed, overweight young man with no future into a U.S. Armed Forces icon and one of the world's top endurance athletes. The only man in history to complete elite training as a Navy SEAL, Army Ranger, and Air Force Tactical Air Controller, he went on to set records in numerous endurance events, inspiring Outside magazine to name him The Fittest (Real) Man in America.",
    "pageCount": 364,
    "categories": ["Self-Help"],
    "subCategories": ["Motivationl", "Personal Transformation"],
    "imageLinks": {
      "thumbnail": "//ws-na.amazon-adsystem.com/widgets/q?_encoding=UTF8&ASIN=1544507879&Format=_SL250_&ID=AsinImage&MarketPlace=US&ServiceVersion=20070822&WS=1&tag=techweb04-20&language=en_US"
    },
    "language": "en",
    "saleInfo": {
      "country": "USA",
      "price": 21.99,
      "discountPrice": 2.99,
      "availableCopy": 23,
      "totalSales": 45
    },
    "reviews": []
  },
  {
    "_id": {
      "$oid": "649ac0a589f9cc13fb27c8ca"
    },
    "title": "The Power of Now: A Guide to Spiritual Enlightenment",
    "authors": ["Eckhart Tolle"],
    "publishedDate": "August 19, 2004",
    "description": "It's no wonder that The Power of Now has sold over 2 million copies worldwide and has been translated into over 30 foreign languages. Much more than simple principles and platitudes, the book takes readers on an inspiring spiritual journey to find their true and deepest self and reach the ultimate in personal growth and spirituality: the discovery of truth and light.",
    "pageCount": 236,
    "categories": ["Self-Help"],
    "subCategories": ["Motivationl", "Spirtual"],
    "imageLinks": {
      "thumbnail": "//ws-na.amazon-adsystem.com/widgets/q?_encoding=UTF8&ASIN=1577314808&Format=_SL250_&ID=AsinImage&MarketPlace=US&ServiceVersion=20070822&WS=1&tag=techweb04-20&language=en_US"
    },
    "language": "en",
    "saleInfo": {
      "country": "USA",
      "price": 8.56,
      "discountPrice": 12.56,
      "availableCopy": 314,
      "totalSales": 55
    },
    "reviews": []
  },
  {
    "_id": {
      "$oid": "649ac0a589f9cc13fb27c8cb"
    },
    "title": "Soul Boom: Why We Need a Spiritual Revolution",
    "authors": ["Rainn Wilson"],
    "publishedDate": "April 25, 2023",
    "description": "The trauma that our struggling species has experienced in recent years—because of both the pandemic and societal tensions that threaten to overwhelm us—is not going away anytime soon. Existing political and economic systems are not enough to bring the change that the world needs. In this book, Rainn Wilson explores the possibility and hope for a spiritual revolution, a “Soul Boom,” to find a healing transformation on both a personal and global level",
    "pageCount": 304,
    "categories": ["Self-Help"],
    "subCategories": ["Spirtual"],
    "imageLinks": {
      "thumbnail": "//ws-na.amazon-adsystem.com/widgets/q?_encoding=UTF8&ASIN=0306828278&Format=_SL250_&ID=AsinImage&MarketPlace=US&ServiceVersion=20070822&WS=1&tag=techweb04-20&language=en_US"
    },
    "language": "en",
    "saleInfo": {
      "country": "USA",
      "price": 10.56,
      "discountPrice": 17.56,
      "availableCopy": 14,
      "totalSales": 56
    },
    "reviews": []
  },
  {
    "_id": {
      "$oid": "649ac0a589f9cc13fb27c8cc"
    },
    "title": "The Highly Sensitive: How to Find Inner Peace, Develop Your Gifts, and Thrive",
    "authors": ["Judy Dyer"],
    "publishedDate": "September 1, 2018",
    "description": "If you’ve always felt more delicate, more easily overwhelmed by sensory input, and more empathetic than those around you, you are probably an HSP. Sensitivity is a blessing, but it’s hard to thrive as an HSP in a competitive society that perceives emotional expression as a sign of weakness.",
    "pageCount": 156,
    "categories": ["Self-Help"],
    "subCategories": ["Spirtual"],
    "imageLinks": {
      "thumbnail": "//ws-na.amazon-adsystem.com/widgets/q?_encoding=UTF8&ASIN=1720622493&Format=_SL250_&ID=AsinImage&MarketPlace=US&ServiceVersion=20070822&WS=1&tag=techweb04-20&language=en_US"
    },
    "language": "en",
    "saleInfo": {
      "country": "USA",
      "price": 10.53,
      "discountPrice": 15.56,
      "availableCopy": 3
    },
    "reviews": []
  },
  {
    "_id": {
      "$oid": "649ac0a589f9cc13fb27c8cd"
    },
    "title": "Lighter: Let Go of the Past, Connect with the Present, and Expand the Future",
    "authors": ["Yung Pueblo"],
    "publishedDate": "October 4, 2022",
    "description": "In Lighter, yung pueblo demonstrates how we can all move forward in our healing, from learning self-compassion to letting go to becoming emotionally mature. As the heaviness falls away, our minds will finally stop feeling overburdened with tension and we’ll be able to reconnect with the present. And the world around us will hopefully become more inviting in crisp and newly vibrant ways. But these are just the first steps. As we grow stronger and expand our self-awareness, it’s our responsibility—and also part of the healing journey—to take actions to support the health and harmony of all people.",
    "pageCount": 288,
    "categories": ["Self-Help"],
    "subCategories": ["Spirtual"],
    "imageLinks": {
      "thumbnail": "//ws-na.amazon-adsystem.com/widgets/q?_encoding=UTF8&ASIN=0593233174&Format=_SL250_&ID=AsinImage&MarketPlace=US&ServiceVersion=20070822&WS=1&tag=techweb04-20&language=en_US"
    },
    "language": "en",
    "saleInfo": {
      "country": "USA",
      "price": 22.53,
      "discountPrice": 12.56,
      "availableCopy": 34,
      "totalSales": 65
    },
    "reviews": []
  },
  {
    "_id": {
      "$oid": "649ac0a589f9cc13fb27c8ce"
    },
    "title": "The Little Book of Hermès: The Story of the Iconic Fashion House",
    "authors": ["Karen Homer"],
    "publishedDate": "May 09, 2023",
    "description": "Through the generations, Hermès have created innovative and exquisite accessories for the most glamorous customers. From their nineteenth-century saddlery workshop to 1960s Paris and beyond, Hermès has graced the arms and wardrobes of style icons from Grace Kelly and Jane Birkin to Victoria Beckham and Kim Kardashian. The Little Book of Hermès tells the story of the evolution of the House of Hermès, through beautiful illustrations of the most coveted items and authoritative text by fashion historian Karen Homer.",
    "pageCount": 160,
    "categories": ["Arts & Photography Books"],
    "subCategories": ["Architecture"],
    "imageLinks": {
      "thumbnail": "//ws-na.amazon-adsystem.com/widgets/q?_encoding=UTF8&ASIN=B09WKLTCHM&Format=_SL250_&ID=AsinImage&MarketPlace=US&ServiceVersion=20070822&WS=1&tag=techweb04-20&language=en_US"
    },
    "language": "en",
    "saleInfo": {
      "country": "USA",
      "price": 10.93,
      "discountPrice": 7.93,
      "availableCopy": 10,
      "totalSales": 77,
      "upto75off": true
    },
    "reviews": []
  },
  {
    "_id": {
      "$oid": "649ac0a589f9cc13fb27c8cf"
    },
    "title": "The Architecture of Trees",
    "authors": ["Cesare Leonardi"],
    "publishedDate": "March 26, 2019",
    "description": "A gorgeous, large format volume that shows each hand-drawn illustration in stunning detail.The Architecture of Trees is the result of over twenty years of dedicated study by landscape architects Cesare Leonardi and Franca Stagi. This new edition preserves the original magnificent illustrations and text, translated into English for the first time.",
    "pageCount": 160,
    "categories": ["Arts & Photography Books"],
    "subCategories": ["Architecture"],
    "imageLinks": {
      "thumbnail": "//ws-na.amazon-adsystem.com/widgets/q?_encoding=UTF8&ASIN=1616898062&Format=_SL250_&ID=AsinImage&MarketPlace=US&ServiceVersion=20070822&WS=1&tag=techweb04-20&language=en_US"
    },
    "language": "en",
    "saleInfo": {
      "country": "USA",
      "price": 10.93,
      "discountPrice": 7.93,
      "availableCopy": 10,
      "totalSales": 86
    },
    "reviews": []
  },
  {
    "_id": {
      "$oid": "649ac0a589f9cc13fb27c8d0"
    },
    "title": "A City is Not a Tree: 50th Anniversary Edition",
    "authors": ["Christopher Alexander", "Brianna Wiest"],
    "publishedDate": "January 22, 2020",
    "description": "In 1965, the architect and design theorist Christopher Alexander published a landmark theoretical critique of modern urban design, and by extension, modern design in general. His critique was different from others of the day in that it was not based on a social or political argument, but rather, on a structural analysis, rooted in then-emerging insights from the fields of mathematics and cognition. Here, published again on its fiftieth anniversary, is Alexander's classic text, together with new interpretive commentaries and discussions by leading theorists and practitioners. This volume is destined to become an invaluable resource for a new generation of students and practitioners.",
    "pageCount": 236,
    "categories": ["Arts & Photography Books"],
    "subCategories": ["Architecture"],
    "imageLinks": {
      "thumbnail": "//ws-na.amazon-adsystem.com/widgets/q?_encoding=UTF8&ASIN=9463864814&Format=_SL250_&ID=AsinImage&MarketPlace=US&ServiceVersion=20070822&WS=1&tag=techweb04-20&language=en_US"
    },
    "language": "en",
    "saleInfo": {
      "country": "USA",
      "price": 20.93,
      "discountPrice": 6.93,
      "availableCopy": 11,
      "totalSales": 80,
      "upto75off": true
    },
    "reviews": []
  },
  {
    "_id": {
      "$oid": "649ac0a589f9cc13fb27c8d1"
    },
    "title": "Vitruvius: The Ten Books on Architecture",
    "authors": ["Vitruvius"],
    "publishedDate": "January 22, 2020",
    "description": "Marcus Vitruvius Pollio, a Roman architect and engineer flourishing in the first century B.C., was the author of the oldest and most influential work on architecture in existence. For hundreds of years, the specific instructions he gave in his 'Ten Books on Architecture' were followed faithfully, and major buildings in all parts of the world reveal the widespread influence of his precepts. According to the Encyclopedia Britannica, he was 'the chief authority studied by architects, and in every point his precepts were accepted as final. Bramante, Michelangelo, Palladio, Vignola, and earlier were careful students of the work of Vitruvius.' His book is thus one of those rare works that have been supremely important in the creation of the greatest art masterpieces.",
    "pageCount": 331,
    "categories": ["Arts & Photography Books", "Motivational"],
    "subCategories": ["Architecture"],
    "imageLinks": {
      "thumbnail": "//ws-na.amazon-adsystem.com/widgets/q?_encoding=UTF8&ASIN=0486206459&Format=_SL250_&ID=AsinImage&MarketPlace=US&ServiceVersion=20070822&WS=1&tag=techweb04-20&language=en_US"
    },
    "language": "en",
    "saleInfo": {
      "country": "USA",
      "price": 21.93,
      "discountPrice": 10.93,
      "availableCopy": 15,
      "totalSales": 23
    },
    "reviews": []
  },
  {
    "_id": {
      "$oid": "649ac0a589f9cc13fb27c8d2"
    },
    "title": "Think and Grow Rich: The Landmark Bestseller Now Revised and Updated for the 21st Century (Think and Grow Rich Series)",
    "authors": ["Napoleon Hill"],
    "contributors": ["Arthur R. Pell"],
    "publishedDate": "November 21, 2022",
    "description": "Think and Grow Rich has been called the 'Granddaddy of All Motivational Literature.' It was the first book to boldly ask, 'What makes a winner?' The man who asked and listened for the answer, Napoleon Hill, is now counted in the top ranks of the world's winners himself. The most famous of all teachers of success spent 'a fortune and the better part of a lifetime of effort' to produce the 'Law of Success' philosophy that forms the basis of his books and that is so powerfully summarized in this one.",
    "pageCount": 320,
    "categories": ["Self-Help"],
    "subCategories": ["Motivationl", "Personal Transformation"],
    "imageLinks": {
      "thumbnail": "//ws-na.amazon-adsystem.com/widgets/q?_encoding=UTF8&ASIN=B0BMSZSG5Z&Format=_SL250_&ID=AsinImage&MarketPlace=US&ServiceVersion=20070822&WS=1&tag=techweb04-20&language=en_US"
    },
    "language": "en",
    "saleInfo": {
      "country": "USA",
      "price": 12.99,
      "discountPrice": 10.99,
      "availableCopy": 30,
      "totalSales": 34
    },
    "reviews": []
  },
  {
    "_id": {
      "$oid": "64cf1ee868a150b1873703b6"
    },
    "title": "Game Changer: Our Fifty-Year Mission to Secure America's Energy Independence",
    "authors": ["Harold Hamm", "Mike Pompeo"],
    "publishedDate": "August 1, 2023",
    "description": "Robert Iger became CEO of The Walt Disney Company in 2005, during a difficult time. Competition was more intense than ever and technology was changing faster than at any time in the company's history. His vision came down to three clear ideas: Recommit to the concept that quality matters, embrace technology instead of fighting it, and think bigger—think global—and turn Disney into a stronger brand in international markets. Today, Disney is the largest, most admired media company in the world, counting Pixar, Marvel, Lucasfilm, and 21st Century Fox among its properties. Under Iger's leadership, Disney's value grew nearly five times what it was, making Iger one of the most innovating and successful CEOs of our era.",
    "pageCount": 352,
    "categories": ["Business & Money"],
    "subCategories": ["Biographie"],
    "imageLinks": {
      "thumbnail": "//ws-na.amazon-adsystem.com/widgets/q?_encoding=UTF8&ASIN=1637631855&Format=_SL250_&ID=AsinImage&MarketPlace=US&ServiceVersion=20070822&WS=1&tag=techweb07-20&language=en_US"
    },
    "language": "en",
    "saleInfo": {
      "country": "USA",
      "price": 24.49,
      "discountPrice": 2.93,
      "availableCopy": 20,
      "totalSales": 10,
      "upto75off": true
    },
    "reviews": []
  },
  {
    "_id": {
      "$oid": "64cf1ee868a150b1873703b7"
    },
    "title": "Elon Musk",
    "authors": ["Walter Isaacson"],
    "publishedDate": "September 12, 2023",
    "description": "When Elon Musk was a kid in South Africa, he was regularly beaten by bullies. One day a group pushed him down some concrete steps and kicked him until his face was a swollen ball of flesh. He was in the hospital for a week. But the physical scars were minor compared to the emotional ones inflicted by his father, an engineer, rogue, and charismatic fantasist. His father's impact on his psyche would linger. He developed into a tough yet vulnerable man-child, prone to abrupt Jekyll-and-Hyde mood swings, with an exceedingly high tolerance for risk, a craving for drama, an epic sense of mission, and a maniacal intensity that was callous and at times destructive.",
    "pageCount": 688,
    "categories": ["Business & Money"],
    "subCategories": ["Biographie"],
    "imageLinks": {
      "thumbnail": "//ws-na.amazon-adsystem.com/widgets/q?_encoding=UTF8&ASIN=1982181281&Format=_SL250_&ID=AsinImage&MarketPlace=US&ServiceVersion=20070822&WS=1&tag=techweb07-20&language=en_US"
    },
    "language": "en",
    "saleInfo": {
      "country": "USA",
      "price": 28,
      "discountPrice": 16.99,
      "availableCopy": 20,
      "totalSales": 10
    },
    "reviews": []
  },
  {
    "_id": {
      "$oid": "64cf1ee868a150b1873703b8"
    },
    "title": "Creativity, Inc.: Overcoming the Unseen Forces That Stand in the Way of True Inspiration",
    "authors": ["Ed Catmull", "Amy Wallace"],
    "publishedDate": "April 8, 2014",
    "description": "Creativity, Inc. is a manual for anyone who strives for originality and the first-ever, all-access trip into the nerve center of Pixar Animation—into the meetings, postmortems, and “Braintrust” sessions where some of the most successful films in history are made. It is, at heart, a book about creativity—but it is also, as Pixar co-founder and president Ed Catmull writes, “an expression of the ideas that I believe make the best in us possible.",
    "pageCount": 368,
    "categories": ["Business & Money"],
    "subCategories": ["Biographie"],
    "imageLinks": {
      "thumbnail": "//ws-na.amazon-adsystem.com/widgets/q?_encoding=UTF8&ASIN=0812993012&Format=_SL250_&ID=AsinImage&MarketPlace=US&ServiceVersion=20070822&WS=1&tag=techweb07-20&language=en_US"
    },
    "language": "en",
    "saleInfo": {
      "country": "USA",
      "price": 24.49,
      "discountPrice": 4.93,
      "availableCopy": 20,
      "totalSales": 10,
      "upto75off": true
    },
    "reviews": []
  },
  {
    "_id": {
      "$oid": "64cf1ee868a150b1873703b9"
    },
    "title": "Titan: The Life of John D. Rockefeller, Sr.",
    "authors": ["Ron Chernow"],
    "publishedDate": "March 30, 2004",
    "description": "From the acclaimed, award-winning author of Alexander Hamilton: here is the essential, endlessly engrossing biography of John D. Rockefeller, Sr.—the Jekyll-and-Hyde of American capitalism. In the course of his nearly 98 years, Rockefeller was known as both a rapacious robber baron, whose Standard Oil Company rode roughshod over an industry, and a philanthropist who donated money lavishly to universities and medical centers. He was the terror of his competitors, the bogeyman of reformers, the delight of caricaturists—and an utter enigma.",
    "pageCount": 832,
    "categories": ["Business & Money"],
    "subCategories": ["Biographie"],
    "imageLinks": {
      "thumbnail": "//ws-na.amazon-adsystem.com/widgets/q?_encoding=UTF8&ASIN=1400077303&Format=_SL250_&ID=AsinImage&MarketPlace=US&ServiceVersion=20070822&WS=1&tag=techweb07-20&language=en_US"
    },
    "language": "en",
    "saleInfo": {
      "country": "USA",
      "price": 81.49,
      "discountPrice": 14.99,
      "availableCopy": 20,
      "totalSales": 10,
      "upto75off": true
    },
    "reviews": []
  },
  {
    "_id": {
      "$oid": "64cf1ee868a150b1873703ba"
    },
    "title": "The Ride of a Lifetime: Lessons Learned from 15 Years as CEO of the Walt Disney Company",
    "authors": ["Robert Iger"],
    "publishedDate": "September 23, 2019",
    "description": "Robert Iger became CEO of The Walt Disney Company in 2005, during a difficult time. Competition was more intense than ever and technology was changing faster than at any time in the company's history. His vision came down to three clear ideas: Recommit to the concept that quality matters, embrace technology instead of fighting it, and think bigger—think global—and turn Disney into a stronger brand in international markets. Today, Disney is the largest, most admired media company in the world, counting Pixar, Marvel, Lucasfilm, and 21st Century Fox among its properties. Under Iger's leadership, Disney's value grew nearly five times what it was, making Iger one of the most innovating and successful CEOs of our era.",
    "pageCount": 272,
    "categories": ["Business & Money"],
    "subCategories": ["Biographie"],
    "imageLinks": {
      "thumbnail": "//ws-na.amazon-adsystem.com/widgets/q?_encoding=UTF8&ASIN=0399592091&Format=_SL250_&ID=AsinImage&MarketPlace=US&ServiceVersion=20070822&WS=1&tag=techweb07-20&language=en_US"
    },
    "language": "en",
    "saleInfo": {
      "country": "USA",
      "price": 16.59,
      "discountPrice": 15.99,
      "availableCopy": 20,
      "totalSales": 10
    },
    "reviews": []
  },
  {
    "_id": {
      "$oid": "64cf1ee868a150b1873703bb"
    },
    "title": "Unreasonable Hospitality: The Remarkable Power of Giving People More Than They Expect",
    "authors": ["Will Guidara"],
    "publishedDate": "October 25, 2022",
    "description": "How did Guidara pull off this unprecedented transformation? Radical reinvention, a true partnership between the kitchen and the dining room—and memorable, over-the-top, bespoke hospitality. Guidara’s team surprised a family who had never seen snow with a magical sledding trip to Central Park after their dinner; they filled a private dining room with sand, complete with mai-tais and beach chairs, to console a couple with a cancelled vacation. And his hospitality extended beyond those dining at the restaurant to his own team, who learned to deliver praise and criticism with intention; why the answer to some of the most pernicious business dilemmas is to give more—not less; and the magic that can happen when a busser starts thinking like an owner.",
    "pageCount": 288,
    "categories": ["Business & Money"],
    "subCategories": ["Management & Leadership"],
    "imageLinks": {
      "thumbnail": "//ws-na.amazon-adsystem.com/widgets/q?_encoding=UTF8&ASIN=0593418573&Format=_SL250_&ID=AsinImage&MarketPlace=US&ServiceVersion=20070822&WS=1&tag=techweb07-20&language=en_US"
    },
    "language": "en",
    "saleInfo": {
      "country": "USA",
      "price": 24.99,
      "discountPrice": 13.99,
      "availableCopy": 20,
      "totalSales": 10
    },
    "reviews": []
  },
  {
    "_id": {
      "$oid": "64cf1ee868a150b1873703bc"
    },
    "title": "The 7 Habits of Highly Effective People: 30th Anniversary Edition",
    "authors": ["Stephen R. Covey"],
    "publishedDate": "May 19, 2020",
    "description": "One of the most inspiring and impactful books ever written, The 7 Habits of Highly Effective People has captivated readers for nearly three decades. It has transformed the lives of presidents and CEOs, educators and parents—millions of people of all ages and occupations. Now, this 30th anniversary edition of the timeless classic commemorates the wisdom of the 7 Habits with modern additions from Sean Covey.",
    "pageCount": 464,
    "categories": ["Business & Money"],
    "subCategories": ["Management & Leadership"],
    "imageLinks": {
      "thumbnail": "//ws-na.amazon-adsystem.com/widgets/q?_encoding=UTF8&ASIN=1982137274&Format=_SL250_&ID=AsinImage&MarketPlace=US&ServiceVersion=20070822&WS=1&tag=techweb07-20&language=en_US"
    },
    "language": "en",
    "saleInfo": {
      "country": "USA",
      "price": 18.79,
      "discountPrice": 14.99,
      "availableCopy": 20,
      "totalSales": 10
    },
    "reviews": []
  },
  {
    "_id": {
      "$oid": "64cf1ee868a150b1873703bd"
    },
    "title": "Crucial Conversations: Tools for Talking When Stakes are High, Third Edition",
    "authors": ["Joseph Grenny", "Kerry Patterson"],
    "publishedDate": "October 21, 2021",
    "description": "The book that revolutionized business communications has been updated for today’s workplace. Crucial Conversations provides powerful skills to ensure every conversation―especially difficult ones―leads to the results you want. Written in an engaging and witty style, it teaches readers how to be persuasive rather than abrasive, how to get back to productive dialogue when others blow up or clam up, and it offers powerful skills for mastering high-stakes conversations, regardless of the topic or person.",
    "pageCount": 304,
    "categories": ["Business & Money"],
    "subCategories": ["Management & Leadership"],
    "imageLinks": {
      "thumbnail": "//ws-na.amazon-adsystem.com/widgets/q?_encoding=UTF8&ASIN=1260474186&Format=_SL250_&ID=AsinImage&MarketPlace=US&ServiceVersion=20070822&WS=1&tag=techweb07-20&language=en_US"
    },
    "language": "en",
    "saleInfo": {
      "country": "USA",
      "price": 25.99,
      "discountPrice": 11.99,
      "availableCopy": 20,
      "totalSales": 10
    },
    "reviews": []
  },
  {
    "_id": {
      "$oid": "64cf1ee868a150b1873703be"
    },
    "title": "The Right Call: What Sports Teach Us About Work and Life",
    "authors": ["Sally Jenkins"],
    "publishedDate": "June 6, 2023",
    "description": "Sportswriter Sally Jenkins has spent her entire adult life observing and writing about great coaches and athletes. With her engaging and expert prose, she has helped shape the way we view these talented sports icons. But somewhere along the line, she realized, they had begun to shape her. Now, she presents the astonishing inner qualities in these same people that pushed them to overcome pressure, elevate their performances, and discover champion identities.",
    "pageCount": 272,
    "categories": ["Business & Money"],
    "subCategories": ["Management & Leadership"],
    "imageLinks": {
      "thumbnail": "//ws-na.amazon-adsystem.com/widgets/q?_encoding=UTF8&ASIN=1982122552&Format=_SL250_&ID=AsinImage&MarketPlace=US&ServiceVersion=20070822&WS=1&tag=techweb07-20&language=en_US"
    },
    "language": "en",
    "saleInfo": {
      "country": "USA",
      "price": 25.19,
      "discountPrice": 14.99,
      "availableCopy": 20,
      "totalSales": 10
    },
    "reviews": []
  },
  {
    "_id": {
      "$oid": "64cf1ee868a150b1873703bf"
    },
    "title": "Stop Overthinking: 23 Techniques to Relieve Stress, Stop Negative Spirals, Declutter Your Mind, and Focus on the Present",
    "authors": ["Nick Trenton"],
    "publishedDate": "March 1, 2021",
    "description": "Stop Overthinking is a book that understands where you’ve been through,the exhausting situation you’ve put yourself into, and how you lose your mind in the trap of anxiety and stress. Acclaimed author Nick Trenton will walk you through the obstacles with detailed and proven techniques to help you rewire your brain, control your thoughts, and change your mental habits.What’s more, the book will provide you scientific approaches to completely change the way you think and feel about yourself by ending the vicious thought patterns.",
    "pageCount": 200,
    "categories": ["Business & Money"],
    "subCategories": ["Management & Leadership"],
    "imageLinks": {
      "thumbnail": "//ws-na.amazon-adsystem.com/widgets/q?_encoding=UTF8&ASIN=B08XLLF3PG&Format=_SL250_&ID=AsinImage&MarketPlace=US&ServiceVersion=20070822&WS=1&tag=techweb07-20&language=en_US"
    },
    "language": "en",
    "saleInfo": {
      "country": "USA",
      "price": 20.69,
      "discountPrice": 19.99,
      "availableCopy": 20,
      "totalSales": 10
    },
    "reviews": []
  },
  {
    "_id": {
      "$oid": "64cf1ee868a150b1873703c0"
    },
    "title": "How Not to Be Wrong: The Power of Mathematical Thinking",
    "authors": ["Jordan Ellenberg"],
    "publishedDate": "May 26, 2015",
    "description": "Math allows us to see the hidden structures underneath the messy and chaotic surface of our world. It’s a science of not being wrong, hammered out by centuries of hard work and argument. Armed with the tools of mathematics, we can see through to the true meaning of information we take for granted: How early should you get to the airport? What does “public opinion” really represent? Why do tall parents have shorter children? Who really won Florida in 2000? And how likely are you, really, to develop cancer?",
    "pageCount": 480,
    "categories": ["Science & Math"],
    "subCategories": ["Mathematics", "History"],
    "imageLinks": {
      "thumbnail": "//ws-na.amazon-adsystem.com/widgets/q?_encoding=UTF8&ASIN=0143127535&Format=_SL250_&ID=AsinImage&MarketPlace=US&ServiceVersion=20070822&WS=1&tag=techweb07-20&language=en_US"
    },
    "language": "en",
    "saleInfo": {
      "country": "USA",
      "price": 21.75,
      "discountPrice": 13.99,
      "availableCopy": 20,
      "totalSales": 10
    },
    "reviews": []
  },
  {
    "_id": {
      "$oid": "64cf1ee868a150b1873703c1"
    },
    "title": "Mathematics for Human Flourishing",
    "authors": ["Francis Su"],
    "publishedDate": "February 2, 2021",
    "description": "In this profound book, written for a wide audience but especially for those disenchanted by their past experiences, an award‑winning mathematician and educator weaves parables, puzzles, and personal reflections to show how mathematics meets basic human desires—such as for play, beauty, freedom, justice, and love—and cultivates virtues essential for human flourishing. These desires and virtues, and the stories told here, reveal how mathematics is intimately tied to being human. Some lessons emerge from those who have struggled, including philosopher Simone Weil, whose own mathematical contributions were overshadowed by her brother’s, and Christopher Jackson, who discovered mathematics as an inmate in a federal prison.",
    "pageCount": 288,
    "categories": ["Science & Math"],
    "subCategories": ["Mathematics", "History"],
    "imageLinks": {
      "thumbnail": "//ws-na.amazon-adsystem.com/widgets/q?_encoding=UTF8&ASIN=0300258518&Format=_SL250_&ID=AsinImage&MarketPlace=US&ServiceVersion=20070822&WS=1&tag=techweb07-20&language=en_US"
    },
    "language": "en",
    "saleInfo": {
      "country": "USA",
      "price": 34.46,
      "discountPrice": 13.99,
      "availableCopy": 20,
      "totalSales": 10
    },
    "reviews": []
  },
  {
    "_id": {
      "$oid": "64cf1ee868a150b1873703c2"
    },
    "title": "Oliver Byrne's Elements of Euclid: The First Six Books with Coloured Diagrams and Symbols",
    "authors": ["Art Meets Science"],
    "publishedDate": "May 12, 2022",
    "description": "Scattered across each page in brilliant reds, blues, and yellows are triangles, squares and circles combined in a myriad of combinations with intersecting lines and numbers. These intricate figures express the proofs of many of the iconic geometric equations that form the bedrock of mathematical study. This stunning example of numerical visual study greatly influenced the history of mathematics, with Euclid's text being used in classrooms until the late nineteenth century. It has also proven to be an indispensable inspiration for following twentieth-century art movements, with avant-garde groups like De Stijl and The Bauhaus using Byrne's iconic colour, line work and form in many of their works.",
    "pageCount": 308,
    "categories": ["Science & Math"],
    "subCategories": ["Mathematics", "History"],
    "imageLinks": {
      "thumbnail": "//ws-na.amazon-adsystem.com/widgets/q?_encoding=UTF8&ASIN=1528770439&Format=_SL250_&ID=AsinImage&MarketPlace=US&ServiceVersion=20070822&WS=1&tag=techweb07-20&language=en_US"
    },
    "language": "en",
    "saleInfo": {
      "country": "USA",
      "price": 34.99,
      "discountPrice": 9.99,
      "availableCopy": 20,
      "totalSales": 10
    },
    "reviews": []
  },
  {
    "_id": {
      "$oid": "64cf1ee868a150b1873703c3"
    },
    "title": "Is Math Real?: How Simple Questions Lead Us to Mathematics’ Deepest Truths",
    "authors": ["Eugenia Cheng"],
    "publishedDate": "August 15, 2023",
    "description": "Where do we learn math: From rules in a textbook? From logic and deduction? Not really, according to mathematician Eugenia Cheng: we learn it from human curiosity—most importantly, from asking questions. This may come as a surprise to those who think that math is about finding the one right answer, or those who were told that the “dumb” question they asked just proved they were bad at math. But Cheng shows why people who ask questions like “Why does 1 + 1 = 2?” are at the very heart of the search for mathematical truth.",
    "pageCount": 336,
    "categories": ["Science & Math"],
    "subCategories": ["Mathematics", "History"],
    "imageLinks": {
      "thumbnail": "//ws-na.amazon-adsystem.com/widgets/q?_encoding=UTF8&ASIN=1541601823&Format=_SL250_&ID=AsinImage&MarketPlace=US&ServiceVersion=20070822&WS=1&tag=techweb07-20&language=en_US"
    },
    "language": "en",
    "saleInfo": {
      "country": "USA",
      "price": 27,
      "discountPrice": 18.99,
      "availableCopy": 20,
      "totalSales": 10
    },
    "reviews": []
  },
  {
    "_id": {
      "$oid": "64cf1ee868a150b1873703c4"
    },
    "title": "The Man Who Solved the Market: How Jim Simons Launched the Quant Revolution",
    "authors": ["Gregory Zuckerman"],
    "publishedDate": "November 5, 2019",
    "description": "Jim Simons is the greatest money maker in modern financial history. No other investor--Warren Buffett, Peter Lynch, Ray Dalio, Steve Cohen, or George Soros--can touch his record. Since 1988, Renaissance's signature Medallion fund has generated average annual returns of 66 percent. The firm has earned profits of more than $100 billion; Simons is worth twenty-three billion dollars.",
    "pageCount": 384,
    "categories": ["Science & Math"],
    "subCategories": ["Mathematics", "History"],
    "imageLinks": {
      "thumbnail": "//ws-na.amazon-adsystem.com/widgets/q?_encoding=UTF8&ASIN=073521798X&Format=_SL250_&ID=AsinImage&MarketPlace=US&ServiceVersion=20070822&WS=1&tag=techweb07-20&language=en_US"
    },
    "language": "en",
    "saleInfo": {
      "country": "USA",
      "price": 15.77,
      "discountPrice": 13.99,
      "availableCopy": 20,
      "totalSales": 10
    },
    "reviews": []
  },
  {
    "_id": {
      "$oid": "64cf1ee868a150b1873703c5"
    },
    "title": "Shift (Silo, 2)",
    "authors": ["Hugh Howey"],
    "publishedDate": "March 22, 2016",
    "description": "In 2007, the Center for Automation in Nanobiotech (CAN) outlined the hardware and software platforms that would one day allow robots smaller than human cells to make medical diagnoses, conduct repairs, and even self-propagate. The technology has an almost limitless capacity for good—but in the wrong hands, it could have an equally boundless capacity for evil. In the same year, the CBS network re-aired a program about the effects of propranolol on sufferers of extreme trauma. A simple pill, it had been discovered, could wipe out the memory of any traumatic event.",
    "pageCount": 576,
    "categories": ["Science Fiction & Fantasy"],
    "subCategories": ["Science Fiction", "Adventures"],
    "imageLinks": {
      "thumbnail": "//ws-na.amazon-adsystem.com/widgets/q?_encoding=UTF8&ASIN=0544839641&Format=_SL250_&ID=AsinImage&MarketPlace=US&ServiceVersion=20070822&WS=1&tag=techweb07-20&language=en_US"
    },
    "language": "en",
    "saleInfo": {
      "country": "USA",
      "price": 13.49,
      "discountPrice": 11.99,
      "availableCopy": 20,
      "totalSales": 10
    },
    "reviews": []
  },
  {
    "_id": {
      "$oid": "64cf1ee868a150b1873703c6"
    },
    "title": "Dust: Book Three of the Silo Series (Silo, 3)",
    "authors": ["Hugh Howey"],
    "publishedDate": "March 22, 2016",
    "description": "Juliette, now mayor of Silo 18, doesn’t trust Silo 1, especially its leader, Donald. But in the world of the Silos, there is no black and white—everything is shades of gray. Donald may not be the monster Juliette thinks he is, and may in fact be key to humanity’s continued survival. But can they work together long enough to succeed?",
    "pageCount": 480,
    "categories": ["Science Fiction & Fantasy"],
    "subCategories": ["Science Fiction", "Adventures"],
    "imageLinks": {
      "thumbnail": "//ws-na.amazon-adsystem.com/widgets/q?_encoding=UTF8&ASIN=0544838262&Format=_SL250_&ID=AsinImage&MarketPlace=US&ServiceVersion=20070822&WS=1&tag=techweb07-20&language=en_US"
    },
    "language": "en",
    "saleInfo": {
      "country": "USA",
      "price": 71.32,
      "discountPrice": 56.31,
      "availableCopy": 20,
      "totalSales": 10
    },
    "reviews": [
      {
        "userId": 1,
        "rating": 5,
        "yesVotes": [1, 2, 3, 4],
        "noVotes": [1],
        "review": "Lorem ipsum dolor sit amet consectetur adipisicing elit. Asperiores exercitationem, quod blanditiis eum ratione sunt.",
        "createdAt": 1324234234
      }
    ]
  },
  {
    "_id": {
      "$oid": "64cf1ee868a150b1873703c7"
    },
    "title": "After Death",
    "authors": ["Dean Koontz"],
    "publishedDate": "March 22, 2016",
    "description": "Having awakened with an extraordinary ability unlike anything he—or anyone else—has ever imagined, Michael is capable of being as elusive as a ghost. He sets out to honor his late friend by helping Nina Dozier and her son, John, whom Shelby greatly admired. Although what Michael does for Nina is life changing, his actions also evoke the wrath of John’s father, a member of one of the most violent street gangs in Los Angeles.",
    "pageCount": 360,
    "categories": ["Science Fiction & Fantasy"],
    "subCategories": ["Science Fiction", "Adventures"],
    "imageLinks": {
      "thumbnail": "//ws-na.amazon-adsystem.com/widgets/q?_encoding=UTF8&ASIN=B0BGMH8LLP&Format=_SL250_&ID=AsinImage&MarketPlace=US&ServiceVersion=20070822&WS=1&tag=techweb07-20&language=en_US"
    },
    "language": "en",
    "saleInfo": {
      "country": "USA",
      "price": 18.56,
      "discountPrice": 17.99,
      "availableCopy": 20,
      "totalSales": 10
    },
    "reviews": [
      {
        "userId": 1,
        "rating": 5,
        "yesVotes": [1, 2, 3, 4],
        "noVotes": [1],
        "review": "Lorem ipsum dolor sit amet consectetur adipisicing elit. Asperiores exercitationem, quod blanditiis eum ratione sunt.",
        "createdAt": 1324234234
      }
    ]
  },
  {
    "_id": {
      "$oid": "64cf1ee868a150b1873703c8"
    },
    "title": "Ready Player One: A Novel",
    "authors": ["Ernest Cline"],
    "publishedDate": "June 5, 2012",
    "description": "In the year 2045, reality is an ugly place. The only time Wade Watts really feels alive is when he’s jacked into the OASIS, a vast virtual world where most of humanity spends their days. When the eccentric creator of the OASIS dies, he leaves behind a series of fiendish puzzles, based on his obsession with the pop culture of decades past. Whoever is first to solve them will inherit his vast fortune—and control of the OASIS itself. Then Wade cracks the first clue. Suddenly he’s beset by rivals who’ll kill to take this prize. The race is on—and the only way to survive is to win.",
    "pageCount": 384,
    "categories": ["Science Fiction & Fantasy"],
    "subCategories": ["Science Fiction", "Adventures"],
    "imageLinks": {
      "thumbnail": "//ws-na.amazon-adsystem.com/widgets/q?_encoding=UTF8&ASIN=0307887448&Format=_SL250_&ID=AsinImage&MarketPlace=US&ServiceVersion=20070822&WS=1&tag=techweb07-20&language=en_US"
    },
    "language": "en",
    "saleInfo": {
      "country": "USA",
      "price": 17.89,
      "discountPrice": 10.45,
      "availableCopy": 20,
      "totalSales": 10
    },
    "reviews": [
      {
        "userId": 1,
        "rating": 3,
        "yesVotes": [1, 2, 3, 4],
        "noVotes": [1],
        "review": "Lorem ipsum dolor sit amet consectetur adipisicing elit. Asperiores exercitationem, quod blanditiis eum ratione sunt.",
        "createdAt": 1324234234
      }
    ]
  },
  {
    "_id": {
      "$oid": "64cf1ee868a150b1873703c9"
    },
    "title": "Project Hail Mary: A Novel",
    "authors": ["Andy Weir"],
    "publishedDate": "May 4, 2021",
    "description": "Ryland Grace is the sole survivor on a desperate, last-chance mission—and if he fails, humanity and the earth itself will perish. Except that right now, he doesn’t know that. He can’t even remember his own name, let alone the nature of his assignment or how to complete it. All he knows is that he’s been asleep for a very, very long time. And he’s just been awakened to find himself millions of miles from home, with nothing but two corpses for company.",
    "pageCount": 496,
    "categories": ["Science Fiction & Fantasy"],
    "subCategories": ["Science Fiction", "Adventures"],
    "imageLinks": {
      "thumbnail": "//ws-na.amazon-adsystem.com/widgets/q?_encoding=UTF8&ASIN=0593135202&Format=_SL250_&ID=AsinImage&MarketPlace=US&ServiceVersion=20070822&WS=1&tag=techweb07-20&language=en_US"
    },
    "language": "en",
    "saleInfo": {
      "country": "USA",
      "price": 15.99,
      "discountPrice": 12.99,
      "availableCopy": 20,
      "totalSales": 10
    },
    "reviews": [
      {
        "userId": 3,
        "rating": 2,
        "yesVotes": [1, 2, 3, 4],
        "noVotes": [1],
        "review": "Lorem ipsum dolor sit amet consectetur adipisicing elit. Asperiores exercitationem, quod blanditiis eum ratione sunt.",
        "createdAt": 1324234234
      }
    ]
  }
]
