{
  "books": [
    {
      "id": "SNAjMMp3H5UC",
      "title": "Disruptive Thinking: A Daring Strategy to Change How We Live, Lead, and Love",
      "authors": ["T. D. Jakes", "Nick Chiles"],
      "publishedDate": "2023-05-09",
      "description": "In this book for leaders, thinkers, doers, and creators, Bishop T.D. Jakes illuminates the pathway to encouraging and unleashing disruptive thinking and provides the wisdom and practical skills we need to evolve our most original and potentially transformational ideas from vision to reality. Through his insight into how our minds and emotions work and through his experiences as a pastor, entrepreneur, and creator, Bishop Jakes leads us into a new way of relating to and transforming the world around us for good. Disruptive Thinking will show you the mindset and the tools you need to create groundbreaking and meaningful change in your own life and in the world around you.",
      "pageCount": 272,
      "categories": ["Self-Help"],
      "subCatagory": ["Motivationl"],
      "imageLinks": {
        "thumbnail": "//ws-na.amazon-adsystem.com/widgets/q?_encoding=UTF8&ASIN=1546004009&Format=_SL250_&ID=AsinImage&MarketPlace=US&ServiceVersion=20070822&WS=1&tag=techweb04-20&language=en_US"
      },
      "language": "en",
      "saleInfo": {
        "country": "USA",
        "price": 16.93,
        "discountPrice": 15.93,
        "availableCopy": 20,
        "totalSales": 10
      }
    },
    {
      "id": "SNAaMMp3H5UC",
      "title": "The Mountain Is You: Transforming Self-Sabotage Into Self-Mastery",
      "authors": ["Brianna Wiest"],
      "publishedDate": "2023-06-01",
      "description": "This is a book about self-sabotage. Why we do it, when we do it, and how to stop doing it—for good. Coexisting but conflicting needs create self-sabotaging behaviors. This is why we resist efforts to change, often until they feel completely futile. But by extracting crucial insight from our most damaging habits, building emotional intelligence by better understanding our brains and bodies, releasing past experiences at a cellular level, and learning to act as our highest potential future selves, we can step out of our own way and into our potential. For centuries, the mountain has been used as a metaphor for the big challenges we face, especially ones that seem impossible to overcome. To scale our mountains, we actually have to do the deep internal work of excavating trauma, building resilience, and adjusting how we show up for the climb. In the end, it is not the mountain we master, but ourselves.",
      "pageCount": 248,
      "categories": ["Self-Help"],
      "subCatagory": ["Motivationl"],
      "imageLinks": {
        "thumbnail": "//ws-na.amazon-adsystem.com/widgets/q?_encoding=UTF8&ASIN=1949759229&Format=_SL250_&ID=AsinImage&MarketPlace=US&ServiceVersion=20070822&WS=1&tag=techweb04-20&language=en_US"
      },
      "language": "en",
      "saleInfo": {
        "country": "USA",
        "price": 17.99,
        "discountPrice": 14.99,
        "availableCopy": 10,
        "totalSales": 12
      }
    },
    {
      "id": "SNAbMMp3H5UC",
      "title": "Read Me When You Need Me.",
      "authors": ["NSB Books"],
      "publishedDate": "2022-11-21",
      "description": "This book sets us in a time where we can possess a written form of love expressed by another person, like an old classy letter, to someone close to you or someone who's been so close to you but distance may have taken it's place. This book serves not just as a sentimental gift, but a keepsake, a forever reminder of your gratitude for that one special person. ",
      "pageCount": 130,
      "categories": ["Self-Help"],
      "subCatagory": ["Motivationl"],
      "imageLinks": {
        "thumbnail": "//ws-na.amazon-adsystem.com/widgets/q?_encoding=UTF8&ASIN=B0BMSZSG5Z&Format=_SL250_&ID=AsinImage&MarketPlace=US&ServiceVersion=20070822&WS=1&tag=techweb04-20&language=en_US"
      },
      "language": "en",
      "saleInfo": {
        "country": "USA",
        "price": 9.99,
        "discountPrice": 2.99,
        "availableCopy": 40,
        "totalSales": 30
      }
    },
    {
      "id": "SNAcMMp3H5UC",
      "title": "Think and Grow Rich: The Landmark Bestseller Now Revised and Updated for the 21st Century (Think and Grow Rich Series)",
      "authors": ["Napoleon Hill"],
      "contributors": ["Arthur R. Pell"],
      "publishedDate": "2022-11-21",
      "description": "Think and Grow Rich has been called the 'Granddaddy of All Motivational Literature.' It was the first book to boldly ask, 'What makes a winner?' The man who asked and listened for the answer, Napoleon Hill, is now counted in the top ranks of the world's winners himself. The most famous of all teachers of success spent 'a fortune and the better part of a lifetime of effort' to produce the 'Law of Success' philosophy that forms the basis of his books and that is so powerfully summarized in this one.",
      "pageCount": 320,
      "categories": ["Self-Help"],
      "subCatagory": ["Motivationl", "Personal Transformation"],
      "imageLinks": {
        "thumbnail": "//ws-na.amazon-adsystem.com/widgets/q?_encoding=UTF8&ASIN=B0BMSZSG5Z&Format=_SL250_&ID=AsinImage&MarketPlace=US&ServiceVersion=20070822&WS=1&tag=techweb04-20&language=en_US"
      },
      "language": "en",
      "saleInfo": {
        "country": "USA",
        "price": 12.99,
        "discountPrice": 10.99,
        "availableCopy": 30,
        "totalSales": 34
      }
    },
    {
      "id": "SNAdMMp3H5UC",
      "title": "As a Man Thinketh: A book that will help you to help yourself",
      "authors": ["James Allen"],
      "publishedDate": "2021-08-24",
      "description": "As a Man Thinketh is a self-help book by James Allen, published in 1903. It was described by Allen as '... [dealing] with the power of thought, and particularly with the use and application of thought to happy and beautiful issues. I have tried to make the book simple, so that all can easily grasp and follow its teaching, and put into practice the methods which it advises. It shows how, in his own thought-world, each man holds the key to every condition, good or bad, that enters into his life, and that, by working patiently and intelligently upon his thoughts, he may remake his life, and transform his circumstances. The price of the book is only one shilling, and it can be carried in the pocket.' It was also described by Allen as 'A book that will help you to help yourself', 'A pocket companion for thoughtful people', and 'A book on the power and right application of thought.",
      "pageCount": 77,
      "categories": ["Self-Help"],
      "subCatagory": ["Personal Transformation"],
      "imageLinks": {
        "thumbnail": "//ws-na.amazon-adsystem.com/widgets/q?_encoding=UTF8&ASIN=B09DJ8TT61&Format=_SL250_&ID=AsinImage&MarketPlace=US&ServiceVersion=20070822&WS=1&tag=techweb04-20&language=en_US"
      },
      "language": "en",
      "saleInfo": {
        "country": "USA",
        "price": 11.99,
        "discountPrice": 7.99,
        "availableCopy": 30,
        "totalSales": 43
      }
    },
    {
      "id": "SNAeMMp3H5UC",
      "title": "Can't Hurt Me: Master Your Mind and Defy the Odds - Clean Edition",
      "authors": ["David Goggins"],
      "publishedDate": "June 1, 2020",
      "description": "For David Goggins, childhood was a nightmare - poverty, prejudice, and physical abuse colored his days and haunted his nights. But through self-discipline, mental toughness, and hard work, Goggins transformed himself from a depressed, overweight young man with no future into a U.S. Armed Forces icon and one of the world's top endurance athletes. The only man in history to complete elite training as a Navy SEAL, Army Ranger, and Air Force Tactical Air Controller, he went on to set records in numerous endurance events, inspiring Outside magazine to name him The Fittest (Real) Man in America.",
      "pageCount": 364,
      "categories": ["Self-Help"],
      "subCatagory": ["Motivationl", "Personal Transformation"],
      "imageLinks": {
        "thumbnail": "//ws-na.amazon-adsystem.com/widgets/q?_encoding=UTF8&ASIN=1544507879&Format=_SL250_&ID=AsinImage&MarketPlace=US&ServiceVersion=20070822&WS=1&tag=techweb04-20&language=en_US"
      },
      "language": "en",
      "saleInfo": {
        "country": "USA",
        "price": 21.99,
        "discountPrice": 20.99,
        "availableCopy": 23,
        "totalSales": 45
      }
    },
    {
      "id": "SNAfMMp3H5UC",
      "title": "The Power of Now: A Guide to Spiritual Enlightenment",
      "authors": ["Eckhart Tolle"],
      "publishedDate": "August 19, 2004",
      "description": "It's no wonder that The Power of Now has sold over 2 million copies worldwide and has been translated into over 30 foreign languages. Much more than simple principles and platitudes, the book takes readers on an inspiring spiritual journey to find their true and deepest self and reach the ultimate in personal growth and spirituality: the discovery of truth and light.",
      "pageCount": 236,
      "categories": ["Self-Help"],
      "subCatagory": ["Motivationl", "Spirtual"],
      "imageLinks": {
        "thumbnail": "//ws-na.amazon-adsystem.com/widgets/q?_encoding=UTF8&ASIN=1577314808&Format=_SL250_&ID=AsinImage&MarketPlace=US&ServiceVersion=20070822&WS=1&tag=techweb04-20&language=en_US"
      },
      "language": "en",
      "saleInfo": {
        "country": "USA",
        "price": 8.56,
        "discountPrice": 12.56,
        "availableCopy": 314,
        "totalSales": 55
      }
    },
    {
      "id": "SNAgMMp3H5UC",
      "title": "Soul Boom: Why We Need a Spiritual Revolution",
      "authors": ["Rainn Wilson"],
      "publishedDate": "April 25, 2023",
      "description": "The trauma that our struggling species has experienced in recent years—because of both the pandemic and societal tensions that threaten to overwhelm us—is not going away anytime soon. Existing political and economic systems are not enough to bring the change that the world needs. In this book, Rainn Wilson explores the possibility and hope for a spiritual revolution, a “Soul Boom,” to find a healing transformation on both a personal and global level",
      "pageCount": 304,
      "categories": ["Self-Help"],
      "subCatagory": ["Spirtual"],
      "imageLinks": {
        "thumbnail": "//ws-na.amazon-adsystem.com/widgets/q?_encoding=UTF8&ASIN=0306828278&Format=_SL250_&ID=AsinImage&MarketPlace=US&ServiceVersion=20070822&WS=1&tag=techweb04-20&language=en_US"
      },
      "language": "en",
      "saleInfo": {
        "country": "USA",
        "price": 10.56,
        "discountPrice": 17.56,
        "availableCopy": 14,
        "totalSales": 56
      }
    },
    {
      "id": "SNAhMMp3H5UC",
      "title": "The Highly Sensitive: How to Find Inner Peace, Develop Your Gifts, and Thrive",
      "authors": ["Judy Dyer"],
      "publishedDate": "September 1, 2018",
      "description": "If you’ve always felt more delicate, more easily overwhelmed by sensory input, and more empathetic than those around you, you are probably an HSP. Sensitivity is a blessing, but it’s hard to thrive as an HSP in a competitive society that perceives emotional expression as a sign of weakness.",
      "pageCount": 156,
      "categories": ["Self-Help"],
      "subCatagory": ["Spirtual"],
      "imageLinks": {
        "thumbnail": "//ws-na.amazon-adsystem.com/widgets/q?_encoding=UTF8&ASIN=1720622493&Format=_SL250_&ID=AsinImage&MarketPlace=US&ServiceVersion=20070822&WS=1&tag=techweb04-20&language=en_US"
      },
      "language": "en",
      "saleInfo": {
        "country": "USA",
        "price": 10.53,
        "discountPrice": 15.56,
        "availableCopy": 3
      }
    },
    {
      "id": "SNAiMMp3H5UC",
      "title": "Lighter: Let Go of the Past, Connect with the Present, and Expand the Future",
      "authors": ["Yung Pueblo"],
      "publishedDate": "October 4, 2022",
      "description": "In Lighter, yung pueblo demonstrates how we can all move forward in our healing, from learning self-compassion to letting go to becoming emotionally mature. As the heaviness falls away, our minds will finally stop feeling overburdened with tension and we’ll be able to reconnect with the present. And the world around us will hopefully become more inviting in crisp and newly vibrant ways. But these are just the first steps. As we grow stronger and expand our self-awareness, it’s our responsibility—and also part of the healing journey—to take actions to support the health and harmony of all people.",
      "pageCount": 288,
      "categories": ["Self-Help"],
      "subCatagory": ["Spirtual"],
      "imageLinks": {
        "thumbnail": "//ws-na.amazon-adsystem.com/widgets/q?_encoding=UTF8&ASIN=0593233174&Format=_SL250_&ID=AsinImage&MarketPlace=US&ServiceVersion=20070822&WS=1&tag=techweb04-20&language=en_US"
      },
      "language": "en",
      "saleInfo": {
        "country": "USA",
        "price": 22.53,
        "discountPrice": 12.56,
        "availableCopy": 34,
        "totalSales": 65
      }
    },
    {
      "id": "SNAkMMp3H5UC",
      "title": "The Little Book of Hermès: The Story of the Iconic Fashion House",
      "authors": ["Karen Homer"],
      "publishedDate": "2023-05-09",
      "description": "Through the generations, Hermès have created innovative and exquisite accessories for the most glamorous customers. From their nineteenth-century saddlery workshop to 1960s Paris and beyond, Hermès has graced the arms and wardrobes of style icons from Grace Kelly and Jane Birkin to Victoria Beckham and Kim Kardashian. The Little Book of Hermès tells the story of the evolution of the House of Hermès, through beautiful illustrations of the most coveted items and authoritative text by fashion historian Karen Homer.",
      "pageCount": 160,
      "categories": ["Arts & Photography Books"],
      "subCatagory": ["Architecture"],
      "imageLinks": {
        "thumbnail": "//ws-na.amazon-adsystem.com/widgets/q?_encoding=UTF8&ASIN=B09WKLTCHM&Format=_SL250_&ID=AsinImage&MarketPlace=US&ServiceVersion=20070822&WS=1&tag=techweb04-20&language=en_US"
      },
      "language": "en",
      "saleInfo": {
        "country": "USA",
        "price": 10.93,
        "discountPrice": 7.93,
        "availableCopy": 10,
        "totalSales": 77
      }
    },
    {
      "id": "SNAlMMp3H5UC",
      "title": "The Architecture of Trees",
      "authors": ["Cesare Leonardi"],
      "publishedDate": "March 26, 2019",
      "description": "A gorgeous, large format volume that shows each hand-drawn illustration in stunning detail.The Architecture of Trees is the result of over twenty years of dedicated study by landscape architects Cesare Leonardi and Franca Stagi. This new edition preserves the original magnificent illustrations and text, translated into English for the first time.",
      "pageCount": 160,
      "categories": ["Arts & Photography Books"],
      "subCatagory": ["Architecture"],
      "imageLinks": {
        "thumbnail": "//ws-na.amazon-adsystem.com/widgets/q?_encoding=UTF8&ASIN=1616898062&Format=_SL250_&ID=AsinImage&MarketPlace=US&ServiceVersion=20070822&WS=1&tag=techweb04-20&language=en_US"
      },
      "language": "en",
      "saleInfo": {
        "country": "USA",
        "price": 10.93,
        "discountPrice": 7.93,
        "availableCopy": 10,
        "totalSales": 86
      }
    },
    {
      "id": "SNAmMMp3H5UC",
      "title": "A City is Not a Tree: 50th Anniversary Edition",
      "authors": ["Christopher Alexander"],
      "publishedDate": "January 22, 2020",
      "description": "In 1965, the architect and design theorist Christopher Alexander published a landmark theoretical critique of modern urban design, and by extension, modern design in general. His critique was different from others of the day in that it was not based on a social or political argument, but rather, on a structural analysis, rooted in then-emerging insights from the fields of mathematics and cognition. Here, published again on its fiftieth anniversary, is Alexander's classic text, together with new interpretive commentaries and discussions by leading theorists and practitioners. This volume is destined to become an invaluable resource for a new generation of students and practitioners.",
      "pageCount": 236,
      "categories": ["Arts & Photography Books"],
      "subCatagory": ["Architecture"],
      "imageLinks": {
        "thumbnail": "//ws-na.amazon-adsystem.com/widgets/q?_encoding=UTF8&ASIN=1616898062&Format=_SL250_&ID=AsinImage&MarketPlace=US&ServiceVersion=20070822&WS=1&tag=techweb04-20&language=en_US"
      },
      "language": "en",
      "saleInfo": {
        "country": "USA",
        "price": 20.93,
        "discountPrice": 6.93,
        "availableCopy": 11,
        "totalSales": 80
      }
    },
    {
      "id": "SNAnMMp3H5UC",
      "title": "Vitruvius: The Ten Books on Architecture",
      "authors": ["Vitruvius"],
      "publishedDate": "January 22, 2020",
      "description": "Marcus Vitruvius Pollio, a Roman architect and engineer flourishing in the first century B.C., was the author of the oldest and most influential work on architecture in existence. For hundreds of years, the specific instructions he gave in his 'Ten Books on Architecture' were followed faithfully, and major buildings in all parts of the world reveal the widespread influence of his precepts. According to the Encyclopedia Britannica, he was 'the chief authority studied by architects, and in every point his precepts were accepted as final. Bramante, Michelangelo, Palladio, Vignola, and earlier were careful students of the work of Vitruvius.' His book is thus one of those rare works that have been supremely important in the creation of the greatest art masterpieces.",
      "pageCount": 331,
      "categories": ["Arts & Photography Books"],
      "subCatagory": ["Architecture"],
      "imageLinks": {
        "thumbnail": "//ws-na.amazon-adsystem.com/widgets/q?_encoding=UTF8&ASIN=0486206459&Format=_SL250_&ID=AsinImage&MarketPlace=US&ServiceVersion=20070822&WS=1&tag=techweb04-20&language=en_US"
      },
      "language": "en",
      "saleInfo": {
        "country": "USA",
        "price": 21.93,
        "discountPrice": 10.93,
        "availableCopy": 15,
        "totalSales": 23
      }
    }
  ]
}
